# import math
# number = int(input("Введіть номер квартири: ")) % 36
# floor = number / 4
# print(f'Квартира знаходиться на {math.ceil(floor)}-му поверсі')

#----------------------------------------------------- задача 2

# dot = dict(zip(['X', 'Y'], map(int, input("Введіть X та Y (через пробіл): ").split())))
# if dot['X'] < 0 and dot['Y'] < 0:
#     print('Точка знаходиться в 3-й четверті')
#
# elif dot['X'] > 0 and dot['Y'] > 0:
#     print('Точка знаходиться в 1-й четверті')
#
# elif dot['X'] < 0 and dot['Y'] > 0:
#     print('Точка знаходиться в 2-й четверті')
#
# elif dot['X'] > 0 and dot['Y'] < 0:
#     print('Точка знаходиться в 4-й четверті')
#
# else:
#     print('Точка лежить на вісі X або Y та не належить ні одній координатній четверті')

